[
  {
    "speaker_name": "Julianne Nyhan",
    "role": "Interviewer",
    "utterance": "What is your earliest memory of encountering computing technology?",
    "order": 1
  },
  {
    "speaker_name": "Judy Malloy",
    "role": "Interviewee",
    "utterance": "I'm going to start with a pre-encountering of computer technology because I think it's important to my story. My first job, after I graduated with a degree in English with a minor concentration in Art, was at the Library of Congress in Washington DC, where I worked as a searcher/editor for the Union Catalog. Now, the Union Catalog is the Library of Congress' huge catalog that includes every book that it holds. It contains millions and millions of records, and at that time in 1964, it wasn't computerised. It was a year later that they hired Henriette D. Avram to come and begin computerising the library (see, for example, Avram et al. 1967). I think that this was important to me because I certainly saw the need for it. The catalog was in this huge room in the Navy Yard Annex and not in the Library of Congress building itself. It was a huge, huge warehouse, full of card catalogs. And to work on the cards, we rolled around on chairs. It's important to me because card catalogs have pervaded my life and my work to a certain extent, not only due to the experience of seeing so many cards, but also due to knowing that the need to automate them was of interest.",
    "order": 2
  },
  {
    "speaker_name": "Julianne Nyhan",
    "role": "Interviewer",
    "utterance": "Whether in descriptions of preparing punched cards or of manually manipulating card catalogs and other earlier technologies it is the physicality of the operation that always strikes me. That is something we have lost.",
    "order": 3
  },
  {
    "speaker_name": "Judy Malloy",
    "role": "Interviewee",
    "utterance": "Indeed, we have lost that. A few years later, following an interval of camping around Europe and doing some writing, I went to work for, I think it was, the J. Walter Thompson Company, who had a contract with the Goddard Space Flight Center. It was around 1967 and the Goddard Space Flight Center was computerising their library. It was one of the earlier efforts to computerise libraries on a large scale. My job there was to catalog the documents and books that were in their collection, and then, sometimes, I'd key punch them in myself or sometimes a key puncher offered to do that.I never saw the computer at the Goddard Space Center. When we were finished creating the records for the computer we took them and put them in the slot. Now, I used to think that the slot accessed some long tunnel to the Goddard Space Flight Center, but when I was looking at the map I saw that the Space Center was actually not that close to where I was working. They must have gone to a truck or something. I remember very clearly punching the cards, or taking the punched cards from someone who punched them, and putting them in the slot, and then they went off to the computer. But I'm not sure that this was a standard key punch card operation or precisely what the output was. It may have been an interim step in the process because I don't think the output was the standard IBM keypunch card.The other thing I remember clearly is problems with the machines. Has operating key punch machines and how finicky they were come up in some of your other work with key punch people?",
    "order": 4
  },
  {
    "speaker_name": "Julianne Nyhan",
    "role": "Interviewer",
    "utterance": "Yes and no because everybody tends to have a different focus.",
    "order": 5
  },
  {
    "speaker_name": "Judy Malloy",
    "role": "Interviewee",
    "utterance": "The machines tended to break a lot, and it turned out that the best way to fix them was to sort of hit them. It was actually a known technique - just gently slap them! [Both laugh]. It was something I would get very good at, some people would call me and say, \"would you come and do whatever it is you do to make this thing work?\" And, so I remember struggling with that technology.I always enjoyed cataloguing - it was a relaxing kind of job. So, after that, my boyfriend got drafted, and he was sent to Germany. I went to Germany and we got married there after much paperwork. I worked in the Special Library System in Furth, and I lived in Dürer Platz in the old walled City of Nurnberg and bicycled to work. Then, we came back to America, and when we got to Boulder, in Colorado, we decided that we'd like to stay there. We were camping in the mountains, so I remember putting on a suit very clearly. In those days, fairly often as a woman, you could not go into a company wearing pants. I went down to this huge aerospace company called the Ball Brothers Research Corporation (BBRC; now called Ball Aerospace), where a position was advertised. I applied for the position of technical librarian and got it. Actually, that was a bit of a surprise for me and so all of a sudden I was the head of a large technical library for a big aerospace company. They made the orbiting solar observatory. It was an incredibly beautiful piece of hardware, it got mounted on rockets and then launched with a mission of solar observation.So, the library was quite large. You could not take things out of the company because you had to have a clearance to work there. It wasn't military, but some of the technology was top secret. I dealt with the documents and I'm not sure exactly how it occurred that I began to computerise the library. I think part of the idea may have come from me, because I had been interested in that since seeing how Goddard was doing it. It was a fairly sizeable library of documents and the computer room was fairly close to where I was working. So I undertook the job to computerise the library. Now, at that time, there were not a lot of known ways to do this. Not like now. There was no applications software; there were very few documents that told you how to do this. Essentially I was working with a computer that I had to programme in FORTRAN and so I learnt to programme in FORTRAN.This was not the era of big Computer Science departments, it was 1969, and not all engineers and scientists knew how to programme. BBRC at that time, like many other corporations, went on a campaign against what they called the 'slide rule engineers', who were still there then. You know, they walked around the company with slide rules in their pockets. BBRC decided that engineers needed to use the computer, and luckily for me, since I needed instructions in how to do this, they gave classes. So I joined the slide rule engineers and scientists, and took classes in FORTRAN from Dan Anderson. He ran the computer room and also taught the classes. Then I still had some questions about how to do it, so I took a summer institute at the University of Denver's Graduate School of Librarianship on Library Systems Analysis, I think it was. That was possibly the most important thing I ever did as far as my later career of writing electronic literature was concerned. It was so important to me to learn that way of thinking. It's not just programming, it's also a way of thinking when you have a problem.The problem that faced me was actually not that difficult, and I had staff. I had a woman who worked with me, Jo Sanford, who was also learning to programme. So we worked on this together; occasionally Dan Anderson helped us when we ran into blocks. The most important thing was not the act of the programming but the Systems Analysis, the act of analysing how we were going to do this. I like to tell electronic literature students, \"step back\". Nowadays people are using applications and they don't always think this through. Step back, and even if you use the old-fashioned flowchart, think about exactly what you want to do. Think about the algorithms you are going to use. I don't want to scare them too much, so I always use this book, The Art of Asking your Boss for a Raise, I don't know if you've ever seen this?",
    "order": 6
  },
  {
    "speaker_name": "Julianne Nyhan",
    "role": "Interviewer",
    "utterance": "[laughs] No.",
    "order": 7
  },
  {
    "speaker_name": "Judy Malloy",
    "role": "Interviewee",
    "utterance": "It's by Georges Perec (2011), who was a member of the Oulipo, and the 2011 English edition was translated by David Bellos. Essentially, Perec was asked to write a book using computer processes. So, he simply rambles on and on about this poor fellow who was trying to get a raise, and walks into his boss' office, \"is the boss there?\", \"yes\", \"is the boss there?\", \"no\", \"is the boss in a good mood?\", \"is the boss in a bad mood\". Somebody actually computerised this and I show it to students so they can see how flowcharts work. It's a wonderful example because it's entertaining and uses different ways of thinking about how to create a work. Perec was a fairly well known experimental author. I mean, somebody might say \"huh?\" but creating a library catalog where you enter information in order to make it searchable and retrievable, for instance, is not so different from writing hypertext. Actually, if you look in Uncle Roger, you can see that I played off the programme I wrote for BBRC. For instance, I used the Boolean operator \"and\" to allow readers to combine words and phrases such as \"uncle Roger\" and \"men in tan suits\".",
    "order": 8
  },
  {
    "speaker_name": "Julianne Nyhan",
    "role": "Interviewer",
    "utterance": "I picked up on two comments in the Pathfinders interview that I'd like to ask you more about. Firstly, when you were discussing the period that we have just been discussing, you mentioned that the idea of using computers in your artistic work had not yet occurred to you. So how did those two things come together?",
    "order": 9
  },
  {
    "speaker_name": "Judy Malloy",
    "role": "Interviewee",
    "utterance": "I had no intention of that at all, it was two separate lives. In fact, I think I told you in an email, that my immediate boss at BBRC, and this is kind of interesting, was José Antonio Villarreal, who was a pioneer Chicano writer. The company hired writers and artists, which I thought was kind of wonderful. José, quite shortly after that, was able to get a university teaching job based on his work as a writer. Neither of us had graduate degrees and we had to make a living. At the time he was writing The Fifth Horseman, which was a story of the Mexican Revolution. His father actually fought with Pancho Villa. One of the best experiences working for BBRC was when José used to come up and sometimes talk with me about what he was working on.At that time I was working on things like a hand-made map that I made a few years later on rice paper and then I made versions on Xerox that I sold, not a lot, but a few copies. This is a colour Xerox copy of a map that I made on rice paper [she holds the map up to the webcam], and a portion of these maps were narrative and under the category of what you would call 'Artists' Books'. But there was certainly no intention at all of using computers in my artistic work. One thing you didn't have access to in those days was personal computers, all you had was a large, scary computer.",
    "order": 10
  },
  {
    "speaker_name": "Julianne Nyhan",
    "role": "Interviewer",
    "utterance": "That was actually my second question. In the Pathfinders interview you said something like \"you have no idea of what a different experience it was using computers then, compared to what it is now\" but the conversation went in a different direction and you didn't get a chance to develop that idea. Would you say something about it now?",
    "order": 11
  },
  {
    "speaker_name": "Judy Malloy",
    "role": "Interviewee",
    "utterance": "Develop that idea? I think the Pathfinders interviewers weren't so interested in that aspect. Also, I don't talk about it too often, because in some ways it's so removed from where I work, and what I do. I think I used a mainframe, I've been trying to research what computer I used. I'm not positive it was a mainframe, I'm pretty sure it was an IBM. I thought it was an IBM 1130 but those are smaller in the pictures from what I recollect. My recollection is of a room, about the size of a smallish bedroom, in which the whole wall was covered with a computer. Then there was a large, noisy printer. That was all you got, and there was no monitor - this is important. That there was no monitor is one reason that many people didn't think of using the computer to make interactive art or literature. Of course, some people did (see, for example, Higgins and Kahn 2012), but I certainly didn't think of using it to create my work. (Oh, we have a thunderstorm, can you hear it? JN: Oh, yeah!)Data retrieval was inelegant. If I wanted to do a search on the system with the application I was creating, I first of all had to load the programme on punched cards. Every time you ran the programme you took the stack of punched cards into the computer room and put them on this conveyor belt, which ran across the room and took them into the computer. If you did not have the correct start card on your stack of punched cards, you were in trouble as it wouldn't run. Otherwise it ran the programme and printed out the results. So, if somebody wanted to search for something (satellite guidance systems were the kind of things they looked for) they would give me what they wanted, I would have to create a punched card for that, and then I would integrate that punched card into the entire programme and feed it into the computer. We would come out with a print out of the documents in the library on satellite guidance systems.So, this was not an easy way to work; in fact, it is not my recollection that the database systems that we were creating were used a lot by the engineers. They were still happier to come in and say \"can you just find this for us?\" It was not like now, when you can sit at your desk in your office or at home and search a library catalog - it wasn't wired for one thing. 1969 was the beginning of ARPANET (Naughton 2000) and this technology was not accessible. A few people were connected, MIT's Compatible Time-Sharing System (CTSS) used MAIL to coordinate their research and exchange information, for instance. But BBRC was not connected, as far as I know. So, essentially the access was very different, the process was very different and it was finicky to a certain extent. I told a story about this in the Pathfinders interview, but I can tell it again here if you'd like?",
    "order": 12
  },
  {
    "speaker_name": "Julianne Nyhan",
    "role": "Interviewer",
    "utterance": "Yes, because it's lovely. Well, it is lovely now, but it probably wasn't so lovely then!",
    "order": 13
  },
  {
    "speaker_name": "Judy Malloy",
    "role": "Interviewee",
    "utterance": "This was a terrible moment. I had the programme we created on a big stack of punched cards. This was not a small stack of punched cards and they all had to be kept in order. If you dropped them it was very bad, and putting them in order was not easy. So, I took the punched cards in over lunch hour. You had to sign up for access to the computer, and I had to use it over lunch hour so as not to interfere with important engineer tasks. I took the card stack in and put it on the conveyor belt. I'm standing there, and all of a sudden, all the cards fly into the air. How this happened, I don't know, but when I was telling the story to Stuart Moulthrop during the Pathfinders interview, he told me the same thing had happened to Nancy Kaplan, who's his wife. So I had to go find Dan Anderson (who ran the computer room), and tell him what happened and all those cards had to be put back in order. It was not fun and it was also horrendously embarrassing because it was important to look professional when you were going into the computer room because not everybody was hugely in favour of somebody who wasn't a regular engineer using the equipment.For years I didn't like to tell people that I had worked for BBRC, because they would go, \"you what?\" I didn't like to talk about that although it was germane. I don't mind it now, because I'm going over an age hump and I've realised this was important. The companies in that era (Bell Labs in New Jersey was like that also) were very open to whom they were hiring. They didn't hesitate at BBRC to hire artists and writers, they didn't hesitate to hire someone who had just been bumming around Europe for a year. Nowadays, that would never happen.",
    "order": 14
  },
  {
    "speaker_name": "Julianne Nyhan",
    "role": "Interviewer",
    "utterance": "Many other people I've interviewed have mentioned to me that they also worked in commercial companies. You can read more about that when the other interviews are published.",
    "order": 15
  },
  {
    "speaker_name": "Judy Malloy",
    "role": "Interviewee",
    "utterance": "I'm really looking forward to that because I feel like I'm less out on a limb hearing that. And I think there is some credit due to those companies. I think their willingness was also related to the post-World War II context; what women did during World War II was still remembered. Companies thought that, as a woman, you had some skills, and you could come in and do that.",
    "order": 16
  },
  {
    "speaker_name": "Julianne Nyhan",
    "role": "Interviewer",
    "utterance": "So, in asking this, I'm probably jumping forward in the timeline a bit, but how did the ideas of technology and artist books start intertwining?",
    "order": 17
  },
  {
    "speaker_name": "Judy Malloy",
    "role": "Interviewee",
    "utterance": "OK, this was a bit of a longish process. I was creating various kinds of artist's books. After my son was born, and this is something that you will know as a parent of a young child, it became difficult to create something like this (though I think this is a good story and it's always good to have a positive story of how children influence your life). It became difficult to stretch large sheets of paper out across a drawing board - sometimes children like to play on your drawing board! I was creating connected texts and drawings on large sheets of paper. Some were on rice paper, so they were very fragile. Because I was working for months on one sheet of paper that couldn't easily be corrected the process was not conducive to good interactive parenting. A lot of times I was working during naps, or didn't have that much time to work, or I was working in short bursts. It started by just thinking \"how can I do this?\" It happened that catalog cards were accessible to me, and I thought, \"why don't I try drawing on catalog cards?\"I started drawing on the catalog cards without the vision of how I was going to use them eventually. I started using text and I started using photographs, and I began to have this vision that I could create a non-sequential narrative using catalog cards. I had no access to a computer - it was 1976 when I started doing this. So I thought \"well I generally show my work in exhibitions\", but there weren't a lot of people using computers in exhibitions, although there were a few. So I began making what were essentially small, metal card catalog trays. I used cards that had writing, photographs and drawings on them. I categorised them with text but it was somewhat poetic text. So, if I was telling a story I would write a line of poetry (sometimes I used an image) and put that on a divider on the top, like the old card catalogs were sometimes indexed. Then, behind the line of poetry, the narrative would be told by images, texts and photographs. Essentially, it was early multimedia and not so different from what you might see people working on today as they create narratives with images and all kinds of media.I became almost obsessed with this for a few years, to the point where I began thinking \"what the heck am I doing?\" I thought it was fascinating, it was a wonderful training for becoming an electronic literature writer. I spent hours trying to make certain that the narrative worked exactly right. But when I showed these works, people generally just pulled the cards out and looked at occasional cards. I let them do that, and they usually didn't experience the narrative the way I had intended them to experience it. At that point I began to stop and think, \"Well, I'm enjoying doing this, I think this is great, but I can only make one copy, and I'm not sure I'm reaching the reader with these works\".I then made a small switch to trying to use electromechanical books. I think I started doing that in 1981. In those days, Radio Shack made these electromechanical address books (this was in the days before personal computers were widely available, although they were being used at that point). So, I would purchase these houses for electromechanical address books from Radio Shack, open them up and take out the scrolls (on which you were supposed to put addresses). Instead of the addresses I would put images and text, and these books had little buttons on the front, so you could press the buttons and make them spin around. Once again, it's a protogenic hypertext structure.They had another kind of address book - if you look at the start of the pathfinder interviews, you'll see I'm holding one up, although you can't tell what it is. Essentially, it looked like a small TV. I painted it blue-green. I'd been to the bleachers of a baseball game, and taken pictures of mostly men and a few women. They were all very entertaining (by which I mean that the men and women I photographed played to the camera). And so I took the photographs, colour Xeroxed them, opened the address book, took out the scroll that was in it, and substituted my own scroll of the pictures of the bleachers. So, when you pushed the button you could scan across the bleachers, like a contemporary scrolling web narrative. I don't know if you've seen any? JR Carpenter's City Fish, for instance, is kind of wonderful. The scroll books I made with Radio Shack address books were big hits in exhibitions because they were fun to use. So, I'm still not using computers, but I'm essentially simulating computer technology. To tell you the truth, I hadn't thought of using computers. Why? I don't know. I was using a sculptural object process, partially because I was working with my hands, but it was proto-computer-mediated, and here we go back again to the influence of algorithmic thinking and how that had pervaded my own work without using the technology itself.I started using a computer when my son wanted one. We didn't have a lot of money, but we went and bought a used Apple II, and he brought in Infocom games (interactive fiction; the kids traded the disks) and all kinds of things. At the time, I was doing another kind of work, but I won't spend too much time on that, and I also made works of information art. The works collected information, and then organised it in order to look at the culture of technology and what is conveyed about technology in advertisements. So, I had a project where I was collecting advertisements for computers, it was something I was interested in. I took the slogans off them and created a database. This one I didn't initially programme myself, I used the early Apple II programme called Visidex. But I quickly realised that if I wanted to distribute this I had to write my own programme. So this was the first time I used computers since I left BBRC in 1969, and it was 1986.",
    "order": 18
  },
  {
    "speaker_name": "Julianne Nyhan",
    "role": "Interviewer",
    "utterance": "When you were telling the anecdote about the punched cards you mentioned how embarrassed you were because you were aware that you were supposed to act in a way that was considered professional. Quite aside from your artistic vision, and quite aside from the resources and facilities that were available to you, I wonder, did those attitudes (those of the engineers and others) towards the computer, and the things that were done around the computer, feed into your thoughts? Did you wonder whether computers could even be used in the artistic context?",
    "order": 19
  },
  {
    "speaker_name": "Judy Malloy",
    "role": "Interviewee",
    "utterance": "Well, I'm coming to your question from reading Willard McCarty's interview (McCarty et al. 2012). I was so interested in his attitude to the computer and that of doing computer programming and the men in suits. I don't know if you've seen the man in suits in Uncle Roger? When I read Willard's interview I thought \"oh no, the man in tan suits\". His attitude is was reminiscent of the narrator of Uncle Roger's attitude to the ubiquitous \"men in tan suits\". My attitude was a little different than that of Jenny (the narrator of Uncle Roger), I was really interested in working with information systems, and I learned a lot from that experience. I didn't mention that the Professor of the Systems Analysis course I took was Richard M Dougherty, who went on to be the Head Librarian at UC Berkeley and worked on computerising that catalog. He also went to the University of Michigan and worked on computerising that catalog, again as Head of the Library System. He was very good at showing the thinking, but I've gone off on a bit of a tangent here, a common Irish quality!",
    "order": 20
  },
  {
    "speaker_name": "Julianne Nyhan",
    "role": "Interviewer",
    "utterance": "It's good because you're making clear the many ways that you encountered the technologies and the many attitudes that existed towards it. You're also making clear that it shouldn't only be seen in the context of sterile professionalism ...",
    "order": 21
  },
  {
    "speaker_name": "Judy Malloy",
    "role": "Interviewee",
    "utterance": "Well, I think that helps me answer your question a little bit. Yes, there was a complete gap between my work as an artist and writer, and my work with information. I noticed the same thing with José Antonio Villarreal. I don't think he talked to too many people in the company about what he was doing, except maybe me. He may have but I'm not sure the researchers would have known what José was writing because it was not what you were expected to convey on the surface. For instance, if you were a woman you couldn't wear pants into the company and you couldn't have long hair at that time. I had to buy a wig! I had long hair, this was the late sixties, and you couldn't wear short skirts, you couldn't even wear your hair in a ponytail. You could have a bun, but that's too library!Initially, we were commuting from a tent (I say we because my then husband was also working in a technology company) and we had to get dressed and look professional. The tent was up sort of about 5,000 ft in the Rocky Mountains. There was a long drive down, so you'd have to take a shower at the camp-site, which was not a very convenient shower. This illustrates the contrast and the two lives that I led. And I don't think it's totally uncommon, I mean reading what Willard said in his interview (see McCarty et al. 2012), I could see that contrast again. It's interesting that he picked that up pretty quickly and used it in his own work.But yes, I think what you are saying is actually a part of why I didn't connect the technology with my work. I connected the thinking with my work, I learned a lot from the thinking. I was interested in information. But in the idea of actually using computers some of that attitude may have lingered. Using computers meant I had to go into a big room with a huge computer, I had better look nice and if all the cards go into the air .... This was, perhaps, a gender issue. My colleague, Jo Sanford and I were the only women using the computer room. In some corners, we weren't completely welcome, and that was just the kind of thing that would happen to us. So that was part of it.The other part was access, I didn't have access to a large computer system. It's not totally true that I wasn't thinking about my work in that way, because what I had learned about organising information systems and my focus on how information describes technology came from that experience (see Malloy 2014). But no, it wasn't until we got the old Apple II running in my home that I touched a computer. Occasionally in the 1970s and early 1980s I ran computer searches for companies that I was working for, so this is true only of my own creative work.",
    "order": 22
  },
  {
    "speaker_name": "Julianne Nyhan",
    "role": "Interviewer",
    "utterance": "So, you had formal training at BBRC and in systems analysis at the University of Denver. When you were learning FORTRAN, for example, what were your impressions of it, what did you think of it?",
    "order": 23
  },
  {
    "speaker_name": "Judy Malloy",
    "role": "Interviewee",
    "utterance": "It was hard. I was very good at systems analysis, although in my recollection, not to the liking completely of Professor Dougherty, who had his own ideas. But for my own way of thinking, I was very good at systems analysis and I was very interested in it. The FORTRAN itself I found difficult and occasionally I would get stuck on the programming. I would go to Dan Anderson, and if he was in a mood to help, he would. He was actually very helpful, but he had a lot of other, more important things to do. I think he was the only computer guy in this whole huge company.Occasionally, my colleague Jo Sanford was able to solve things I couldn't. My impression was that she was a better hands-on programmer, but I was good at creating the algorithms and setting up the systems, so we worked pretty well together. But I'll tell you, there's another issue here, I realised that one of the other problems was that there were no manuals at BBRC. I think there was one FORTRAN manual. Nowadays, if you want to learn a programming language, you can get a whole shelf of books that will help you. There are people you can ask who will help you. My recollection is that there was one FORTRAN manual and that was it! There were none of these 'FORTRAN for Dummies' or 'Here's how I did this in FORTRAN' books. When I started using BASIC, which was hugely easier to use, and BASIC is actually not that different from FORTRAN, I had access to the University of California's libraries. When I got stuck, I would go down to the basement and there was an entire bank of at least 40 books on BASIC. I would go over them one at a time until I found out how to do what I wanted to do. You couldn't just go to Google to search online then. Although actually I could have done computer searches because I did have access to that but engineering databases weren't oriented towards fixing your sink or how to do something in BASIC.I also programmed Uncle Roger in Unix Shell scripts (see Malloy 1991), and there the community on the Whole Earth 'Lectronic Link (see, for example, Rheingold 2000; Turner 2010) was very helpful. The people I was working with weren't that knowledgeable at BASIC, so I had to use the books. But once again, this was not available when I was first learning to programme. So what happened was, I was OK on how to write the programme, but I would get stuck on how to do certain things, the way we all do. I'm sure you've encountered that?",
    "order": 24
  },
  {
    "speaker_name": "Julianne Nyhan",
    "role": "Interviewer",
    "utterance": "Yes, absolutely. So, what did you do? Did you hit dead-ends?",
    "order": 25
  },
  {
    "speaker_name": "Judy Malloy",
    "role": "Interviewee",
    "utterance": "I also wasn't familiar with ways of testing to find the bug. And testing to find the bug on a punched-card system is not as easy as on the kind of systems we use nowadays. At that time, if you couldn't find it by your eye you could start running portions of the programme until you found out which portion didn't work. But you didn't have that much access to the room. It was more difficult.",
    "order": 26
  },
  {
    "speaker_name": "Julianne Nyhan",
    "role": "Interviewer",
    "utterance": "When you bought the Apple for your son about 15 years later you must have been struck by how much easier it seemed.",
    "order": 27
  },
  {
    "speaker_name": "Judy Malloy",
    "role": "Interviewee",
    "utterance": "I was struck, I was thrilled. I mean this was 1986, when this all came together for me. I was thrilled by how easy it was, and by how I already had those skills. I knew how to think about the algorithms, I knew how to do the basic programming, and I knew the programming structures. I was finding it hugely easier than I did working at BBRC. Some of that may have been the corporate situation and some of it may have been that it wasn't my own work. Although I was interested in it I was not excited about it; those are two different things. As I noticed also in Willard's interview, I was not financially able not to have a job, in my case because I didn't make that much money as an artist. So, all of a sudden, all these things came together and it wasn't that difficult. I realised that I could do what I'd been trying to do with the card catalogs. You see, I'd started working on the card catalogs in 1976, about 10 years previously. I started working on them before I could actually make the vision I had for the kind of literature they were meant to be into something real by using the Apple II. It was sitting on the desk in our house, you know, it was right there.On top of that, I had the enormous good fortune of having a very good friend, my old friend Carl Loeffler, who made an alternative arts space in San Francisco (see Malloy 2013). Early on, in 1979 I think, he worked on an early communications project, a satellite, using NASA technology. So he had some computer background - he was the founding director of Art Com/La Mamelle and then of Art Com Electronic Network (ACEN) and he also did a fair amount of publishing. But they were always underfunded; like any alternative press and they didn't have large amounts of money. He came up with the idea of taking his whole gallery online. This was in 1986, and he turned that into a place (ACEN) where he could not only communicate with people, but also publish art and get an audience.So he called me up around April or March of 1986, and said he knew I was working with computers because he had seen the database I was making (Bad Information Base no 1). I didn't even know what he was talking about by \"going online\", but he was very persuasive. So, I went out and bought a modem (you had to buy a modem in those days). I got online and when I got there, it was such an extraordinary experience. I mean nowadays we all grow up with this but to actually be able - even though it was slow - to log on to a computer, and suddenly talk to people in Canada, talk to spoken word poet Fortner Anderson in Canada, to Jim Rosenberg in Pennsylvania, Fred Truck in Iowa! And there was a conferencing system (the WELL used the conferencing software PicoSpan) and we could talk about what we were doing.But on top of that, I discovered that you could co-opt the conferencing system into a place for additive storytelling. It was how I first published Uncle Roger; I told people to use their own database software, because most people in that community had something like dBase at that time. So I published each lexia (a hypertext node or block of text) with the keywords, and said to the community, it was a fairly computer literate community, \"I'm gonna put out a lexia every day, like a serial. Pull it into your database, use the keywords that I've given you, and you can make this work on your home computer\". This was in 1986, it was pretty interesting.To add to this, Carl Loeffler initiated and Fred Truck programmed a system and menu where the works could actually be published. The WELL gave ACEN direct access to the server which even nowadays is not easy to get. So basically there was a top menu that accessed the works, which is what I'm talking about here. The works themselves, and in my case the programs I wrote that ran them, were housed in The WELL's VAX. So if you chose Uncle Roger from the menu, my program (written in Unix shell scripts) that ran Uncle Roger was set in motion and the program and data were interactive in response to user commands. This was incredible for 1987!Moreover, we had an audience, and this was part of what Carl was looking for. He had the idea that if you work in the conceptual, performance or video art field that your audience is pretty much limited to the other artists working in the field. That's who goes to openings; that's who looks at work. He thought the work was good enough that it should go to a wider audience and all of a sudden we had an audience too. All this came together at once and it was probably one of the most exciting years of my life. Therefore, I made a shift in my work, I was so thrilled by how I saw that words could be used and how words could be manipulated by the computer, that I thought, \"OK, I can't use images here, but, you know, images, to a certain extent add a different dimension. I'm going to start just working with words\".",
    "order": 28
  },
  {
    "speaker_name": "Julianne Nyhan",
    "role": "Interviewer",
    "utterance": "As you were talking I was trying to think through the various strands of this. What about those colliding points, those points where ideas collide with technology? What you were saying about words seems to be going very much in that direction now.",
    "order": 29
  },
  {
    "speaker_name": "Judy Malloy",
    "role": "Interviewee",
    "utterance": "Yes, in looking at some of the chapters in the book I just finished, this issue of the technology colliding with what you want to do comes up fairly often. Many people wanted to use images. There was also the amount of time to get online, a lag, as they called it at that time. It was frustrating and it was expensive too.",
    "order": 30
  },
  {
    "speaker_name": "Julianne Nyhan",
    "role": "Interviewer",
    "utterance": "I don't really mean that. I mean, did the computer also become a sort of - going back to Willard McCarty - an exploratory tool?",
    "order": 31
  },
  {
    "speaker_name": "Judy Malloy",
    "role": "Interviewee",
    "utterance": "Yes, but maybe I was coming at it a little differently because I already knew what I wanted to do, to a certain extent, because I'd been working with these card catalogs for so many years. It was exploratory, so I had to find out how to make it work on the system. But maybe I was in a slightly different position than other people coming to look at technology with the idea of making art. I had a certain advantage of knowing what I was going to do and I also could put it into practice very quickly. Essentially I was using the computer to fulfil a vision I already had. Now I don't know...that's a little different than the way other people approached it I think.",
    "order": 32
  },
  {
    "speaker_name": "Julianne Nyhan",
    "role": "Interviewer",
    "utterance": "Yes and no. I always think that this is something that's very important to bring out in these interviews, because sometimes it's said, whether of digital artists or digital humanists or whoever, that the technology drives what they're doing. But as you've been so carefully explaining, no, that wasn't always the case at all and the ideas were there and being developed well before the means through which you could computerise them became available.",
    "order": 33
  },
  {
    "speaker_name": "Judy Malloy",
    "role": "Interviewee",
    "utterance": "I see what you're saying. Also, I'm comparing my approach to the approach of other artists, but in DH you are probably more likely to work the way I do and less likely to just play with the technology.In my case, I might also say that this may go back to the beginning of working with systems analysis. In the case of the BBRC library, I already had the problem - there were so many documents and books in the library and I wanted the engineers and scientists in this country [the USA] to be able to access them. That was the problem and I did not start out by playing with the technology, I started out solving a problem, and in most of my work I do that, even now. In other words, when I start a new work, I know this is the narrative I'm going to do: I start with content. Then I design the authoring software; I don't use a lot of application software. If you use application software, you're limited to a certain extent by what it can do. I also don't use a lot of multimedia. I work with words, but I start with what I want to do. I'm generally not using a programme, other than that I'm using HTML or JavaScript, or in the early days, I used BASIC or Unix shell scripts. Then I try to fit the authoring system to the work itself.Now, there's no doubt there are times I get stuck, and recently I've been stuck in a few places trying to force JavaScript to do what I want; I have various ways of doing that. Sometimes I'll bang my head against the wall until it works, or nowadays, instead of having to go to the basement of Berkeley library, you can go to Google and search. Other times, I'll think, well, there must be some other way to do that. I mean this is a little difference again between how I and some digital artists work and how Computer Scientists might work. I'm not sitting there thinking, \"I have to write a perfect programme\". That is not my aim (although I do like elegant code). My aim is to write a programme that displays what I want it to display, or does what I want it to do. If I need a hack to get that happening, I'm not concerned. So yes, I've run up against snags, some recently, and sooner or later I've managed to solve them. Sometimes they can take a long time.This is an issue that always comes up with students of electronic literature. You have to be aware that you can't always take your idea and put it into practice in, you know, 2 days. If you have a final project, you might be lucky and it might work, but it might not, and particularly at this stage in the field, where we are still exploring and experimenting, we're kind of like musicians in the Middle Ages, when music composition theory and practice was developed. We are still developing those things. So, we can't necessarily expect that something is going to happen and that we're going to get what we want overnight. If we're using an application (Storyspace, for example, was a wonderful application) we still, to a certain extent, have to work within the application. It's always been my contention that if you do that the person who designed the application is, to a certain extent, a co-author, because you are working within that system. But I don't actually object to that at all. I think a good application, like Inform 7 or Storyspace is really at the heart of the field. It's just that for the work I want to do I generally prefer to come up with my own authoring systems.",
    "order": 34
  },
  {
    "speaker_name": "Julianne Nyhan",
    "role": "Interviewer",
    "utterance": "OK, so my next question would have been how you first got involved in what we now refer to as DH. I think you've probably covered a lot of that. Is there anything that you want to add?",
    "order": 35
  },
  {
    "speaker_name": "Judy Malloy",
    "role": "Interviewee",
    "utterance": "Well, here we have the issue, and it is something you're much more knowledgeable about than I am, of what DH means? Is there a place for electronic literature in DH or not? This is a question that I don't think there's one answer to...",
    "order": 36
  },
  {
    "speaker_name": "Julianne Nyhan",
    "role": "Interviewer",
    "utterance": "Not so long ago, my colleagues and I published a book called Defining Digital Humanities: a Reader (Terras et al. 2013). It includes a couple of new chapters and otherwise is mostly reprints of some of the most highly-cited articles on this question. Anyway, it comes as no great surprise that we concluded the book by writing that there is no one definition, and probably we shouldn't even have a definition, or that at this stage, a definition isn't useful. So, another question that I was going to ask, related to that, is maybe equally impossible to answer - I wondered what you thought of the Humanities Computing/DH work that you encountered? Did you think it was interesting?",
    "order": 37
  },
  {
    "speaker_name": "Judy Malloy",
    "role": "Interviewee",
    "utterance": "I found it very interesting. One area that deserves more attention is systems for creating DH databases, the kinds of things you've worked on. More attention should be given to how that software works; how it might be applied to creating electronic literature; how, in some ways, electronic literature is reversing the process (for instance, by teasing literary meaning out of vast databases; so, perhaps co-opting the process is a better way of putting it) and what the contingencies are. I don't think enough has been enough done in that field. I would like to spend more time looking at DH processes. And so, it's on my list, and I actually have thought it quite wonderful that in some places, or at some conferences, electronic literature has been shown in conjunction with DH work. I think we in electronic literature should be looking more closely at what you're doing also.",
    "order": 38
  },
  {
    "speaker_name": "Julianne Nyhan",
    "role": "Interviewer",
    "utterance": "The next question is about scholars who were not using computers in their research? Do you have some sense of their views about Humanities Computing? But again, I'm asking that in a very broad sense.",
    "order": 39
  },
  {
    "speaker_name": "Judy Malloy",
    "role": "Interviewee",
    "utterance": "I looked at that question with interest. Well, I don't want to go into this too much, and I'm sure you've encountered this too, the Humanities scholars occasional cold shouldering. I had a couple of stories I thought I'd tell in response to that.Sticking somewhat with the Arts community, and the writers' community, the first story concerns John Cage, who, in 1986 or 1987, I'm not sure which, published a work on Art Com, called the First Meeting of the Satie Society (see Malloy 2016a and Couey 1991). Fred formatted it, and it was available on the ACEN menu, and so we had a big party and Art Com invited John and he came. I'd never met him before, and I started talking to him and we were talking about just this subject, you know, what is going to be the reaction?He told me that in about 1952, when he had done Silence (officially called 4′33″, a work in which the musicians did not play and sometimes actually put down their instruments and did not play. The whole work was about trying to hear the sound in the area) that many people did not speak to him for years. And I thought that was really surprising because 4′33″ is now a very famous work. Yes, it's challenging what music is, and yes, he asked musicians to put down their instruments. When he was telling this to me, I began to see what he was saying. I think what he was saying to me was to expect trouble. It's always easier to think that artists are famous all their lives. They aren't. They run into a lot of problems. I didn't believe that there was that reaction to Silence, because it's such a celebrated work. I actually went and looked later and there was (see, for example, Kostelanetz 1988, pp. 65-68). So what Cage said stuck in my mind for years.There's been a bit of a larger problem in the Literary Arts with electronic literature, but this is a difficult subject. When I was talking to Stuart Moulthrop at the Pathfinders interview about the role of electronic literature in the literary community, I said that I thought it was so helpful when Robert Coover (1992) wrote a series of articles for the New York Times because they really brought a lot of attention to electronic literature. It was reviewed in the Washington Post Book World and in a lot of places. Stuart said \"no, that's when we attracted the attention of the police\". That's when critics stepped in and said \"no, no, this is not good\". I didn't argue with him but I said \"OK, I know what you're saying\". There are so many good poets, not just in this country, everywhere, who spend their lives writing poetry and they are not getting a whole page in the New York Times book review. All of a sudden electronic literature is getting all of the attention and it's not so much that they don't like electronic literature. It's that the community gets so little coverage anyhow, and this is true of any art form, so there's bound to be hostility if electronic literature attracts a lot of attention and is the new deal.And there are some other issues also. I think this issue hasn't been addressed enough. Personally, I think electronic literature and print literature are both literature, and eventually we will consider both to be literature. I do not want to lose print literature; the book is a wonderful interface but it's a different interface. So, I've always wanted what I do to be considered as literature. But that may be somewhat frightening to print writers. I don't think it should be because they do something different. Yes, there's a certain set of skills involved in writing electronic literature that not everyone has. I mean, I think the best comparison to that is music composition, in other words, not everyone can compose music. It requires a certain set of skills.",
    "order": 40
  },
  {
    "speaker_name": "Julianne Nyhan",
    "role": "Interviewer",
    "utterance": "Could you briefly outline what you think those skills are?",
    "order": 41
  },
  {
    "speaker_name": "Judy Malloy",
    "role": "Interviewee",
    "utterance": "That's a difficult question. To begin with, for me composing electronic literature is like the Middle Ages when there were theory composers who wrote lengthy treatises on composing music. Contemporary notation had not yet arrived, and there was a certain beauty in that you could compose in any way you wanted and score in any way you wanted. But, returning to the basic question you were asking, I say you don't have to code and you can use an application. It is still a different skill than writing poetry and print fiction. I don't think it's necessarily an issue of difficulty. You know, as children we grow up reading print literature. If you step back and look at poetry, the novel and print literature, these are all constraint-based art forms to a certain extent but they are art forms that we are familiar with. Now, at this point in time (this may change) to write electronic literature it is helpful to have writing skills and code skills and the ability to manipulate the words in the same way a composer manipulates notes. I should also say that I'm talking here about hyperfiction, interactive fiction and generative poetry. And they are not the only ways to write electronic literature.",
    "order": 42
  },
  {
    "speaker_name": "Julianne Nyhan",
    "role": "Interviewer",
    "utterance": "It's something that's incredibly difficult to answer anyhow, isn't it?",
    "order": 43
  },
  {
    "speaker_name": "Judy Malloy",
    "role": "Interviewee",
    "utterance": "Yes. I think it's also because everyone in the field at the moment approaches it differently and I think that's good. I don't like to see us in the electronic literature field saying that everything should be created with Twine or Inform 7 or that everything should be created in Processing; these are different authoring systems. I like to urge students to step back from the process. I tend to say to them \"what is your vision and what do you want to create? Your vision - not where the software's going to take you\". Then we can see whether there is an application to do that, or, if not, how to do it. Some students can become very excited by that; others can say, \"you know, I don't think so\".",
    "order": 44
  },
  {
    "speaker_name": "Julianne Nyhan",
    "role": "Interviewer",
    "utterance": "Next I want to ask you for your impression of the conference community and the type of conference communities you encountered?",
    "order": 45
  },
  {
    "speaker_name": "Judy Malloy",
    "role": "Interviewee",
    "utterance": "Coming from an art background, I couldn't understand why anyone would want to go to a conference. We went to openings that were free and you were never asked to pay a conference fee to talk. It was either free or you were paid for being on a panel. Also, I couldn't see why you would want to sit around a room, who would want to do that? The first minute I went to a conference I completely changed my mind. The first conference I went to was in 1989 and it was the NCGA Conference that took place in San Jose State University. It was a conference on Computer Art and was hosted by the Computers in Art and Design, Research and Education Institute (CADRE) at San Jose State. I was invited to be on the Art and Telecommunications panel, organized by Carl Loeffler, and including various other people connected with ACEN. Let's see, there was Robert Edgar, Anna Couey, Jeanelle Hurst (from Australia) and, I think, Howard Besser was there also and he is actually connected more with the Museum Computer Network. So it was a mix of people; I was amazed at the interaction, it was very different from going to an art opening or a reading, in that, you know, you're meeting people from all over the word, and there's a lot of very targeted information exchanged. It was exciting, so I changed my mind about conferences. But I was run down in 1994, and I've been on crutches ever since, so unless they are in my area I don't go to a lot of conferences any more, which I miss.",
    "order": 46
  },
  {
    "speaker_name": "Julianne Nyhan",
    "role": "Interviewer",
    "utterance": "I want to ask you about who particularly influenced you, and how. And they can be from any sphere whatsoever.",
    "order": 47
  },
  {
    "speaker_name": "Judy Malloy",
    "role": "Interviewee",
    "utterance": "OK, I want to start with the librarians who worked in the early days with early library retrieval systems, because I think they aren't given enough attention. There was Ralph H. Parker and Richard M. Dougherty, from whom I was lucky to take a systems analysis class, and women such as Henriette D Avram. If you look at what they were doing, Ted Nelson (see, for example, Barnet 2013) essentially took it, romanticised it, and has gotten all the credit. Now, I think he deserves a lot of credit. At the same time, when you're looking at hidden histories, and particularly since there are quite a few women involved ... It's not my subject, so I haven't been following the scholarship in this field, but it doesn't come up in newspaper articles and the kinds of literature that everybody reads. It's an area that deserves more attention and what I mean is that I want to credit all those unsung librarians, who developed computational ways to automate libraries and retrieval, because that's deeply important to the culture, our culture, which runs beneath hypertextual systems. There's not much difference between a keyword and a link, if you look at it in that way. So I think that's important.I've already talked about John Cage. His work lies beneath everybody's work in experimental literature, I think. Many of the works he's done have been influential on my work, I'm thinking of his Interdeterminacy. But he created this work years ago. Cage gave a lot of talks in interesting ways, and I think it happened that David Tudor suggested that he try just telling stories. So he started telling very short stories, the way lexias look. He numbered them and told them in different orders and they were all about his life and the people he worked with. He and David Tudor created a work where Cage read those stories in one room, and in another room Tudor played one of Cage's piano concertos. They did not hear each other, so Cage had to time his stories. A recording was made by putting the two streams together, and this was the kind of thing that Cage did. He did lectures where he created concentric circles and he put words in them. So many of the things he did - we call them constraints in the electronic literature community - are so embedded in what we do nowadays and I think he's very important. Also, important, of course, are Virginia Woolf, James Joyce and Dorothy Richardson, the three writers who tried to break the conventional narrative. Personally, I also love Jane Austen. And so once again, it's like looking at electronic literature and literature as parallel streams. And different kinds of writing flow in each of these streams.On a personal level, my friend of 35 years, Sonya Rapoport (1923-2015), who just died this June inspired me and many others.",
    "order": 48
  },
  {
    "speaker_name": "Julianne Nyhan",
    "role": "Interviewer",
    "utterance": "Oh, I'm sorry",
    "order": 49
  },
  {
    "speaker_name": "Judy Malloy",
    "role": "Interviewee",
    "utterance": "She was a visual artist who used information in her work (Rapoport et al. 1995). She created scrolls and integrated computers into her work. The first time I met her was, I think, in 1980 or 1981, when I went to an installation at 80 Langton Street called 'Objects on my Dresser'. She had created a work where she had taken the objects on her dresser, I think, and written texts about each object. Then, on the floor she had this huge plot called a netweb, this was basically a web, where the writing and the work she did with a psychiatrist were all laid out like a piece of information. Then she did another work called Shoe Field, where she asked people to come in, take off their shoes, and input what they thought about their shoes to a computer. She didn't programme, she worked with a programmer who created a programme to make an array out of each person's statement. So you would take off your shoes, you would put in the information, and you would get a print out back, the kind of print out that people in your field make nowadays, these beautiful graphs. And so we talked.We had working with information in common. We weren't in direct competition, which I think is helpful. I worked more with narrative and she worked more with images, and for over 35 years, we used to talk all the time. We would call each other up. I still think, almost every week, \"I've got to talk to Sonya about that\". You know, I'm working on this problem, I need to talk to Sonya. I can't call her and it makes me so upset. But she was 20 years older than me, more than that actually, a fair amount older than me. She was kind of like an art mother. I think everybody needs an art mother, so she was influential in my life.We've already talked about Carl Loeffler. I'd like to say a few words about Mark Bernstein (chief Scientist at Eastgate, one of the leading publishers of hypertext) because he's so important in the hypertext community. He did something incredible. He was working with the hypertext community, not the literary community. He said people were asking \"where are the hypertexts?\" So, he answered that question by publishing hypertext literature. You know, it's rare to have such an innovative publisher to work with. He put out, oh, I don't know how many titles, but over 30 or 60. I took a look recently when we were talking about representation of women and half of them were by women. He worked with writers as people and was very good at seeing things in our works. He picked up Storyspace from Michael Joyce, and the other people who worked on it, and made it publicly available. He managed to attract attention. I still think the works that came out of Eastgate, which is his company, are certainly among the best in the field. So, I like to give Mark a lot of credit. I'm sure I've left off a lot of people but that's a start. People ask me this question, and sometimes I say something completely different because someone's work is on my mind.",
    "order": 50
  },
  {
    "speaker_name": "Julianne Nyhan",
    "role": "Interviewer",
    "utterance": "Do you regret that you didn't get a full professorial post?",
    "order": 51
  },
  {
    "speaker_name": "Judy Malloy",
    "role": "Interviewee",
    "utterance": "I would love be a full professor. I would love to continue teaching. I just had a wonderful 2 year visiting lecturer job at Princeton. When I was younger, I actually accepted the dual-career situation with some happiness. Plenty have done that. TS Eliot, worked at a bank, Nathaniel Hawthorne worked at a customs house.",
    "order": 52
  },
  {
    "speaker_name": "Julianne Nyhan",
    "role": "Interviewer",
    "utterance": "Philip Larkin worked in a library, didn't he?",
    "order": 53
  },
  {
    "speaker_name": "Judy Malloy",
    "role": "Interviewee",
    "utterance": "Yes, I think so. These are good jobs for poets and writers. Libraries, particularly, are lovely, they are quiet and the work is interesting, I was not unhappy with that at all, you know, when I was in midcareer stage. Although occasionally, as a single parent, I was juggling an awful lot between two careers, and being a parent. Also, it wasn't until recently that I thought, and I think this is partially an age thing, \"I have so much to pass on to students, and I'm so thrilled to be working with students\". I love the work they do and want to see it continue.Now I feel that maybe I only have so many years left, and it's important to me to work with students, to essentially pass the small torch - we all have different torches in electronic literature - to pass on the knowledge that I have about how to make it work. I think people with the knowledge of the history of the field that I have should teach. We won't be around forever, and what we know is very valuable.",
    "order": 54
  },
  {
    "speaker_name": "Julianne Nyhan",
    "role": "Interviewer",
    "utterance": "The final question that I want to ask is whether you feel any disappointments about, about routes that electronic literature didn't take (whether social, cultural, intellectual, technological or whatever)?",
    "order": 55
  },
  {
    "speaker_name": "Judy Malloy",
    "role": "Interviewee",
    "utterance": "Well, I don't put it quite that way. I still think of this as an incredibly open field. I mean, when I started using a computer to do my work in 1986, part of the excitement was the many ways to manipulate words. There are thousands of things we can do. I wonder about recent moves to take electronic literature into the field of multimedia because that's a different field. I see people who work with words leaving words, and I want to ask \"why are you doing this?\" They are doing it partially because that is more encouraged. I mean someone implied to me that one reason why the electronic literature community is going in that direction is hostility from the literary community. A digital writer perceived far less hostility if less words and more images were used. By the way, I think a lot of the works created with images and sound and video are very good. I just want people to also see that there are ways to work with words that are incredible and that we haven't yet explored.",
    "order": 56
  }
]