{
  "previous_utterances": [
    {
      "speaker_name": "Julianne Nyhan",
      "role": "Interviewer",
      "utterance_order": 49,
      "sentences": [
        {
          "sentence": "Oh, I'm sorry",
          "sentence_order": "49-1"
        }
      ]
    },
    {
      "speaker_name": "Judy Malloy",
      "role": "Interviewee",
      "utterance_order": 50,
      "sentences": [
        {
          "sentence": "She was a visual artist who used information in her work (Rapoport et al. 1995).",
          "sentence_order": "50-1"
        },
        {
          "sentence": "She created scrolls and integrated computers into her work.",
          "sentence_order": "50-2"
        },
        {
          "sentence": "The first time I met her was, I think, in 1980 or 1981, when I went to an installation at 80 Langton Street called 'Objects on my Dresser'.",
          "sentence_order": "50-3"
        },
        {
          "sentence": "She had created a work where she had taken the objects on her dresser, I think, and written texts about each object.",
          "sentence_order": "50-4"
        },
        {
          "sentence": "Then, on the floor she had this huge plot called a netweb, this was basically a web, where the writing and the work she did with a psychiatrist were all laid out like a piece of information.",
          "sentence_order": "50-5"
        },
        {
          "sentence": "Then she did another work called Shoe Field, where she asked people to come in, take off their shoes, and input what they thought about their shoes to a computer.",
          "sentence_order": "50-6"
        },
        {
          "sentence": "She didn't programme, she worked with a programmer who created a programme to make an array out of each person's statement.",
          "sentence_order": "50-7"
        },
        {
          "sentence": "So you would take off your shoes, you would put in the information, and you would get a print out back, the kind of print out that people in your field make nowadays, these beautiful graphs.",
          "sentence_order": "50-8"
        },
        {
          "sentence": "And so we talked.",
          "sentence_order": "50-9"
        },
        {
          "sentence": "We had working with information in common.",
          "sentence_order": "50-10"
        },
        {
          "sentence": "We weren't in direct competition, which I think is helpful.",
          "sentence_order": "50-11"
        },
        {
          "sentence": "I worked more with narrative and she worked more with images, and for over 35 years, we used to talk all the time.",
          "sentence_order": "50-12"
        },
        {
          "sentence": "We would call each other up.",
          "sentence_order": "50-13"
        },
        {
          "sentence": "I still think, almost every week, \"I've got to talk to Sonya about that\".",
          "sentence_order": "50-14"
        },
        {
          "sentence": "You know, I'm working on this problem, I need to talk to Sonya.",
          "sentence_order": "50-15"
        },
        {
          "sentence": "I can't call her and it makes me so upset.",
          "sentence_order": "50-16"
        },
        {
          "sentence": "But she was 20 years older than me, more than that actually, a fair amount older than me.",
          "sentence_order": "50-17"
        },
        {
          "sentence": "She was kind of like an art mother.",
          "sentence_order": "50-18"
        },
        {
          "sentence": "I think everybody needs an art mother, so she was influential in my life.",
          "sentence_order": "50-19"
        },
        {
          "sentence": "We've already talked about Carl Loeffler.",
          "sentence_order": "50-20"
        },
        {
          "sentence": "I'd like to say a few words about Mark Bernstein (chief Scientist at Eastgate, one of the leading publishers of hypertext) because he's so important in the hypertext community.",
          "sentence_order": "50-21"
        },
        {
          "sentence": "He did something incredible.",
          "sentence_order": "50-22"
        },
        {
          "sentence": "He was working with the hypertext community, not the literary community.",
          "sentence_order": "50-23"
        },
        {
          "sentence": "He said people were asking \"where are the hypertexts?\" So, he answered that question by publishing hypertext literature.",
          "sentence_order": "50-24"
        },
        {
          "sentence": "You know, it's rare to have such an innovative publisher to work with.",
          "sentence_order": "50-25"
        },
        {
          "sentence": "He put out, oh, I don't know how many titles, but over 30 or 60.",
          "sentence_order": "50-26"
        },
        {
          "sentence": "I took a look recently when we were talking about representation of women and half of them were by women.",
          "sentence_order": "50-27"
        },
        {
          "sentence": "He worked with writers as people and was very good at seeing things in our works.",
          "sentence_order": "50-28"
        },
        {
          "sentence": "He picked up Storyspace from Michael Joyce, and the other people who worked on it, and made it publicly available.",
          "sentence_order": "50-29"
        },
        {
          "sentence": "He managed to attract attention.",
          "sentence_order": "50-30"
        },
        {
          "sentence": "I still think the works that came out of Eastgate, which is his company, are certainly among the best in the field.",
          "sentence_order": "50-31"
        },
        {
          "sentence": "So, I like to give Mark a lot of credit.",
          "sentence_order": "50-32"
        },
        {
          "sentence": "I'm sure I've left off a lot of people but that's a start.",
          "sentence_order": "50-33"
        },
        {
          "sentence": "People ask me this question, and sometimes I say something completely different because someone's work is on my mind.",
          "sentence_order": "50-34"
        }
      ]
    }
  ],
  "current_utterance": [
    {
      "speaker_name": "Julianne Nyhan",
      "role": "Interviewer",
      "utterance_order": 51,
      "sentences": [
        {
          "sentence": "Do you regret that you didn't get a full professorial post?",
          "sentence_order": "51-1"
        }
      ]
    },
    {
      "speaker_name": "Judy Malloy",
      "role": "Interviewee",
      "utterance_order": 52,
      "sentences": [
        {
          "sentence": "I would love be a full professor.",
          "sentence_order": "52-1"
        },
        {
          "sentence": "I would love to continue teaching.",
          "sentence_order": "52-2"
        },
        {
          "sentence": "I just had a wonderful 2 year visiting lecturer job at Princeton.",
          "sentence_order": "52-3"
        },
        {
          "sentence": "When I was younger, I actually accepted the dual-career situation with some happiness.",
          "sentence_order": "52-4"
        },
        {
          "sentence": "Plenty have done that.",
          "sentence_order": "52-5"
        },
        {
          "sentence": "TS Eliot, worked at a bank, Nathaniel Hawthorne worked at a customs house.",
          "sentence_order": "52-6"
        }
      ]
    }
  ]
}