{
  "previous_utterances": [
    {
      "speaker_name": "Julianne Nyhan",
      "role": "Interviewer",
      "utterance_order": 39,
      "sentences": [
        {
          "sentence": "The next question is about scholars who were not using computers in their research?",
          "sentence_order": "39-1"
        },
        {
          "sentence": "Do you have some sense of their views about Humanities Computing?",
          "sentence_order": "39-2"
        },
        {
          "sentence": "But again, I'm asking that in a very broad sense.",
          "sentence_order": "39-3"
        }
      ]
    },
    {
      "speaker_name": "Judy Malloy",
      "role": "Interviewee",
      "utterance_order": 40,
      "sentences": [
        {
          "sentence": "I looked at that question with interest.",
          "sentence_order": "40-1"
        },
        {
          "sentence": "Well, I don't want to go into this too much, and I'm sure you've encountered this too, the Humanities scholars occasional cold shouldering.",
          "sentence_order": "40-2"
        },
        {
          "sentence": "I had a couple of stories I thought I'd tell in response to that.",
          "sentence_order": "40-3"
        },
        {
          "sentence": "Sticking somewhat with the Arts community, and the writers' community, the first story concerns John Cage, who, in 1986 or 1987, I'm not sure which, published a work on Art Com, called the First Meeting of the Satie Society (see Malloy 2016a and Couey 1991).",
          "sentence_order": "40-4"
        },
        {
          "sentence": "Fred formatted it, and it was available on the ACEN menu, and so we had a big party and Art Com invited John and he came.",
          "sentence_order": "40-5"
        },
        {
          "sentence": "I'd never met him before, and I started talking to him and we were talking about just this subject, you know, what is going to be the reaction?",
          "sentence_order": "40-6"
        },
        {
          "sentence": "He told me that in about 1952, when he had done Silence (officially called 4′33″, a work in which the musicians did not play and sometimes actually put down their instruments and did not play. The whole work was about trying to hear the sound in the area) that many people did not speak to him for years.",
          "sentence_order": "40-7"
        },
        {
          "sentence": "And I thought that was really surprising because 4′33″ is now a very famous work.",
          "sentence_order": "40-8"
        },
        {
          "sentence": "Yes, it's challenging what music is, and yes, he asked musicians to put down their instruments.",
          "sentence_order": "40-9"
        },
        {
          "sentence": "When he was telling this to me, I began to see what he was saying.",
          "sentence_order": "40-10"
        },
        {
          "sentence": "I think what he was saying to me was to expect trouble.",
          "sentence_order": "40-11"
        },
        {
          "sentence": "It's always easier to think that artists are famous all their lives.",
          "sentence_order": "40-12"
        },
        {
          "sentence": "They aren't.",
          "sentence_order": "40-13"
        },
        {
          "sentence": "They run into a lot of problems.",
          "sentence_order": "40-14"
        },
        {
          "sentence": "I didn't believe that there was that reaction to Silence, because it's such a celebrated work.",
          "sentence_order": "40-15"
        },
        {
          "sentence": "I actually went and looked later and there was (see, for example, Kostelanetz 1988, pp. 65-68).",
          "sentence_order": "40-16"
        },
        {
          "sentence": "So what Cage said stuck in my mind for years.",
          "sentence_order": "40-17"
        },
        {
          "sentence": "There's been a bit of a larger problem in the Literary Arts with electronic literature, but this is a difficult subject.",
          "sentence_order": "40-18"
        },
        {
          "sentence": "When I was talking to Stuart Moulthrop at the Pathfinders interview about the role of electronic literature in the literary community, I said that I thought it was so helpful when Robert Coover (1992) wrote a series of articles for the New York Times because they really brought a lot of attention to electronic literature.",
          "sentence_order": "40-19"
        },
        {
          "sentence": "It was reviewed in the Washington Post Book World and in a lot of places.",
          "sentence_order": "40-20"
        },
        {
          "sentence": "Stuart said \"no, that's when we attracted the attention of the police\".",
          "sentence_order": "40-21"
        },
        {
          "sentence": "That's when critics stepped in and said \"no, no, this is not good\".",
          "sentence_order": "40-22"
        },
        {
          "sentence": "I didn't argue with him but I said \"OK, I know what you're saying\".",
          "sentence_order": "40-23"
        },
        {
          "sentence": "There are so many good poets, not just in this country, everywhere, who spend their lives writing poetry and they are not getting a whole page in the New York Times book review.",
          "sentence_order": "40-24"
        },
        {
          "sentence": "All of a sudden electronic literature is getting all of the attention and it's not so much that they don't like electronic literature.",
          "sentence_order": "40-25"
        },
        {
          "sentence": "It's that the community gets so little coverage anyhow, and this is true of any art form, so there's bound to be hostility if electronic literature attracts a lot of attention and is the new deal.",
          "sentence_order": "40-26"
        },
        {
          "sentence": "And there are some other issues also.",
          "sentence_order": "40-27"
        },
        {
          "sentence": "I think this issue hasn't been addressed enough.",
          "sentence_order": "40-28"
        },
        {
          "sentence": "Personally, I think electronic literature and print literature are both literature, and eventually we will consider both to be literature.",
          "sentence_order": "40-29"
        },
        {
          "sentence": "I do not want to lose print literature; the book is a wonderful interface but it's a different interface.",
          "sentence_order": "40-30"
        },
        {
          "sentence": "So, I've always wanted what I do to be considered as literature.",
          "sentence_order": "40-31"
        },
        {
          "sentence": "But that may be somewhat frightening to print writers.",
          "sentence_order": "40-32"
        },
        {
          "sentence": "I don't think it should be because they do something different.",
          "sentence_order": "40-33"
        },
        {
          "sentence": "Yes, there's a certain set of skills involved in writing electronic literature that not everyone has.",
          "sentence_order": "40-34"
        },
        {
          "sentence": "I mean, I think the best comparison to that is music composition, in other words, not everyone can compose music.",
          "sentence_order": "40-35"
        },
        {
          "sentence": "It requires a certain set of skills.",
          "sentence_order": "40-36"
        }
      ]
    }
  ],
  "current_utterance": [
    {
      "speaker_name": "Julianne Nyhan",
      "role": "Interviewer",
      "utterance_order": 41,
      "sentences": [
        {
          "sentence": "Could you briefly outline what you think those skills are?",
          "sentence_order": "41-1"
        }
      ]
    },
    {
      "speaker_name": "Judy Malloy",
      "role": "Interviewee",
      "utterance_order": 42,
      "sentences": [
        {
          "sentence": "That's a difficult question.",
          "sentence_order": "42-1"
        },
        {
          "sentence": "To begin with, for me composing electronic literature is like the Middle Ages when there were theory composers who wrote lengthy treatises on composing music.",
          "sentence_order": "42-2"
        },
        {
          "sentence": "Contemporary notation had not yet arrived, and there was a certain beauty in that you could compose in any way you wanted and score in any way you wanted.",
          "sentence_order": "42-3"
        },
        {
          "sentence": "But, returning to the basic question you were asking, I say you don't have to code and you can use an application.",
          "sentence_order": "42-4"
        },
        {
          "sentence": "It is still a different skill than writing poetry and print fiction.",
          "sentence_order": "42-5"
        },
        {
          "sentence": "I don't think it's necessarily an issue of difficulty.",
          "sentence_order": "42-6"
        },
        {
          "sentence": "You know, as children we grow up reading print literature.",
          "sentence_order": "42-7"
        },
        {
          "sentence": "If you step back and look at poetry, the novel and print literature, these are all constraint-based art forms to a certain extent but they are art forms that we are familiar with.",
          "sentence_order": "42-8"
        },
        {
          "sentence": "Now, at this point in time (this may change) to write electronic literature it is helpful to have writing skills and code skills and the ability to manipulate the words in the same way a composer manipulates notes.",
          "sentence_order": "42-9"
        },
        {
          "sentence": "I should also say that I'm talking here about hyperfiction, interactive fiction and generative poetry.",
          "sentence_order": "42-10"
        },
        {
          "sentence": "And they are not the only ways to write electronic literature.",
          "sentence_order": "42-11"
        }
      ]
    }
  ]
}