{
  "previous_utterances": [
    {
      "speaker_name": "Julianne Nyhan",
      "role": "Interviewer",
      "utterance_order": 21,
      "sentences": [
        {
          "sentence": "It's good because you're making clear the many ways that you encountered the technologies and the many attitudes that existed towards it.",
          "sentence_order": "21-1"
        },
        {
          "sentence": "You're also making clear that it shouldn't only be seen in the context of sterile professionalism ...",
          "sentence_order": "21-2"
        }
      ]
    },
    {
      "speaker_name": "Judy Malloy",
      "role": "Interviewee",
      "utterance_order": 22,
      "sentences": [
        {
          "sentence": "Well, I think that helps me answer your question a little bit.",
          "sentence_order": "22-1"
        },
        {
          "sentence": "Yes, there was a complete gap between my work as an artist and writer, and my work with information.",
          "sentence_order": "22-2"
        },
        {
          "sentence": "I noticed the same thing with José Antonio Villarreal.",
          "sentence_order": "22-3"
        },
        {
          "sentence": "I don't think he talked to too many people in the company about what he was doing, except maybe me.",
          "sentence_order": "22-4"
        },
        {
          "sentence": "He may have but I'm not sure the researchers would have known what José was writing because it was not what you were expected to convey on the surface.",
          "sentence_order": "22-5"
        },
        {
          "sentence": "For instance, if you were a woman you couldn't wear pants into the company and you couldn't have long hair at that time.",
          "sentence_order": "22-6"
        },
        {
          "sentence": "I had to buy a wig!",
          "sentence_order": "22-7"
        },
        {
          "sentence": "I had long hair, this was the late sixties, and you couldn't wear short skirts, you couldn't even wear your hair in a ponytail.",
          "sentence_order": "22-8"
        },
        {
          "sentence": "You could have a bun, but that's too library!",
          "sentence_order": "22-9"
        },
        {
          "sentence": "Initially, we were commuting from a tent (I say we because my then husband was also working in a technology company) and we had to get dressed and look professional.",
          "sentence_order": "22-10"
        },
        {
          "sentence": "The tent was up sort of about 5,000 ft in the Rocky Mountains.",
          "sentence_order": "22-11"
        },
        {
          "sentence": "There was a long drive down, so you'd have to take a shower at the camp-site, which was not a very convenient shower.",
          "sentence_order": "22-12"
        },
        {
          "sentence": "This illustrates the contrast and the two lives that I led.",
          "sentence_order": "22-13"
        },
        {
          "sentence": "And I don't think it's totally uncommon, I mean reading what Willard said in his interview (see McCarty et al. 2012), I could see that contrast again.",
          "sentence_order": "22-14"
        },
        {
          "sentence": "It's interesting that he picked that up pretty quickly and used it in his own work.",
          "sentence_order": "22-15"
        },
        {
          "sentence": "But yes, I think what you are saying is actually a part of why I didn't connect the technology with my work.",
          "sentence_order": "22-16"
        },
        {
          "sentence": "I connected the thinking with my work, I learned a lot from the thinking.",
          "sentence_order": "22-17"
        },
        {
          "sentence": "I was interested in information.",
          "sentence_order": "22-18"
        },
        {
          "sentence": "But in the idea of actually using computers some of that attitude may have lingered.",
          "sentence_order": "22-19"
        },
        {
          "sentence": "Using computers meant I had to go into a big room with a huge computer, I had better look nice and if all the cards go into the air ....",
          "sentence_order": "22-20"
        },
        {
          "sentence": "This was, perhaps, a gender issue.",
          "sentence_order": "22-21"
        },
        {
          "sentence": "My colleague, Jo Sanford and I were the only women using the computer room.",
          "sentence_order": "22-22"
        },
        {
          "sentence": "In some corners, we weren't completely welcome, and that was just the kind of thing that would happen to us.",
          "sentence_order": "22-23"
        },
        {
          "sentence": "So that was part of it.",
          "sentence_order": "22-24"
        },
        {
          "sentence": "The other part was access, I didn't have access to a large computer system.",
          "sentence_order": "22-25"
        },
        {
          "sentence": "It's not totally true that I wasn't thinking about my work in that way, because what I had learned about organising information systems and my focus on how information describes technology came from that experience (see Malloy 2014).",
          "sentence_order": "22-26"
        },
        {
          "sentence": "But no, it wasn't until we got the old Apple II running in my home that I touched a computer.",
          "sentence_order": "22-27"
        },
        {
          "sentence": "Occasionally in the 1970s and early 1980s I ran computer searches for companies that I was working for, so this is true only of my own creative work.",
          "sentence_order": "22-28"
        }
      ]
    }
  ],
  "current_utterance": [
    {
      "speaker_name": "Julianne Nyhan",
      "role": "Interviewer",
      "utterance_order": 23,
      "sentences": [
        {
          "sentence": "So, you had formal training at BBRC and in systems analysis at the University of Denver.",
          "sentence_order": "23-1"
        },
        {
          "sentence": "When you were learning FORTRAN, for example, what were your impressions of it, what did you think of it?",
          "sentence_order": "23-2"
        }
      ]
    },
    {
      "speaker_name": "Judy Malloy",
      "role": "Interviewee",
      "utterance_order": 24,
      "sentences": [
        {
          "sentence": "It was hard.",
          "sentence_order": "24-1"
        },
        {
          "sentence": "I was very good at systems analysis, although in my recollection, not to the liking completely of Professor Dougherty, who had his own ideas.",
          "sentence_order": "24-2"
        },
        {
          "sentence": "But for my own way of thinking, I was very good at systems analysis and I was very interested in it.",
          "sentence_order": "24-3"
        },
        {
          "sentence": "The FORTRAN itself I found difficult and occasionally I would get stuck on the programming.",
          "sentence_order": "24-4"
        },
        {
          "sentence": "I would go to Dan Anderson, and if he was in a mood to help, he would.",
          "sentence_order": "24-5"
        },
        {
          "sentence": "He was actually very helpful, but he had a lot of other, more important things to do.",
          "sentence_order": "24-6"
        },
        {
          "sentence": "I think he was the only computer guy in this whole huge company.",
          "sentence_order": "24-7"
        },
        {
          "sentence": "Occasionally, my colleague Jo Sanford was able to solve things I couldn't.",
          "sentence_order": "24-8"
        },
        {
          "sentence": "My impression was that she was a better hands-on programmer, but I was good at creating the algorithms and setting up the systems, so we worked pretty well together.",
          "sentence_order": "24-9"
        },
        {
          "sentence": "But I'll tell you, there's another issue here, I realised that one of the other problems was that there were no manuals at BBRC.",
          "sentence_order": "24-10"
        },
        {
          "sentence": "I think there was one FORTRAN manual.",
          "sentence_order": "24-11"
        },
        {
          "sentence": "Nowadays, if you want to learn a programming language, you can get a whole shelf of books that will help you.",
          "sentence_order": "24-12"
        },
        {
          "sentence": "There are people you can ask who will help you.",
          "sentence_order": "24-13"
        },
        {
          "sentence": "My recollection is that there was one FORTRAN manual and that was it!",
          "sentence_order": "24-14"
        },
        {
          "sentence": "There were none of these 'FORTRAN for Dummies' or 'Here's how I did this in FORTRAN' books.",
          "sentence_order": "24-15"
        },
        {
          "sentence": "When I started using BASIC, which was hugely easier to use, and BASIC is actually not that different from FORTRAN, I had access to the University of California's libraries.",
          "sentence_order": "24-16"
        },
        {
          "sentence": "When I got stuck, I would go down to the basement and there was an entire bank of at least 40 books on BASIC.",
          "sentence_order": "24-17"
        },
        {
          "sentence": "I would go over them one at a time until I found out how to do what I wanted to do.",
          "sentence_order": "24-18"
        },
        {
          "sentence": "You couldn't just go to Google to search online then.",
          "sentence_order": "24-19"
        },
        {
          "sentence": "Although actually I could have done computer searches because I did have access to that but engineering databases weren't oriented towards fixing your sink or how to do something in BASIC.",
          "sentence_order": "24-20"
        },
        {
          "sentence": "I also programmed Uncle Roger in Unix Shell scripts (see Malloy 1991), and there the community on the Whole Earth 'Lectronic Link (see, for example, Rheingold 2000; Turner 2010) was very helpful.",
          "sentence_order": "24-21"
        },
        {
          "sentence": "The people I was working with weren't that knowledgeable at BASIC, so I had to use the books.",
          "sentence_order": "24-22"
        },
        {
          "sentence": "But once again, this was not available when I was first learning to programme.",
          "sentence_order": "24-23"
        },
        {
          "sentence": "So what happened was, I was OK on how to write the programme, but I would get stuck on how to do certain things, the way we all do.",
          "sentence_order": "24-24"
        },
        {
          "sentence": "I'm sure you've encountered that?",
          "sentence_order": "24-25"
        }
      ]
    }
  ]
}